In [ ]:
# This notebook gives some functions of pandas library to deal with raw data.

•	Load data into a pandas DataFrame

In [3]:
import pandas as pd

data = {'type_property': ['Apartment', 'House', 'Villa', 'Condo', 'Loft', 'Mansion', 'Chalet', 'Castle', 'Cottage', 'Ranch'],
        'parent_names_of_place': ['|Tokyo|Yokohama|Kawasaki|', '|Washington D.C.|New York|Boston|', '|London|Manchester|Birmingham|', '|Cambridge|Oxford|Bristol|', '|Paris|Lyon|Marseille|', '|Madrid|Barcelona|Valencia|', '|Rome|Milan|Naples|', '|Berlin|Hamburg|Munich|', '|Amsterdam|Rotterdam|Utrecht|', '|Sydney|Melbourne|Brisbane|'],
        'region': ['Asia', 'North America', 'Europe', 'Europe', 'Europe', 'Europe', 'Europe', 'Europe', 'Europe', 'Australia'],
        'latitude-longitude': ['35.6895, 139.6917', '38.9072, -77.0369', '51.5074, -0.1278', '51.7520, -1.2577', '48.8566, 2.3522', '40.4168, -3.7038', '41.9028, 12.4964', '52.5200, 13.4050', '52.3702, 4.8952', '33.8688, 151.2093'],
        'area_m2': [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
        'price_euro': ['€100,000', '€200,000', '€300,000', '€400,000', '€500,000', '€600,000', '€700,000', '€800,000', '€900,000', '€1,000,000']}

df = pd.DataFrame(data)

In [5]:
df.head()

,type_property,parent_names_of_place,region,latitude-longitude,area_m2,price_euro
0,Apartment,|Tokyo|Yokohama|Kawasaki|,Asia,"35.6895, 139.6917",100,"€100,000"
1,House,|Washington D.C.|New York|Boston|,North America,"38.9072, -77.0369",200,"€200,000"
2,Villa,|London|Manchester|Birmingham|,Europe,"51.5074, -0.1278",300,"€300,000"
3,Condo,|Cambridge|Oxford|Bristol|,Europe,"51.7520, -1.2577",400,"€400,000"
4,Loft,|Paris|Lyon|Marseille|,Europe,"48.8566, 2.3522",500,"€500,000"